musicLrc ="""[00:00.00]英雄寞
[00:04.00]歌手：郑中基
[00:10.00]作词：赵邑方
[00:23.03][01:35:79]等谁那沸腾的魂魄
[00:25.82][01:39:02]如让山水为之褪色
[00:29.16][01:41:83]来拯救就这天涯萧索
[00:34.00][01:47:06]是谁恩怨情仇演活
[00:37.00][01:50:04]心上牵挂无暇抖落
[00:40.00][01:52:86]只为世事杀出传说
[00:44.00][01:57:12]唯旷世经纬胸怀天下
[00:51.02][02:03:00]血染敌阵却为残杀
[00:53.00][02:06:24]难道有违天道错
[00:56.79][02:09:09]叹悲歌为彻为憾奈何
[01:02.00][02:15:02]怕岁月过只随信念活
[01:05.58][02:18:00]等后世来评说
[01:07.00][02:20:01]你是风沙的怒吼
[01:10.00][02:23:02]你是断崖的坚守
[01:13.00][02:26:12]你是剑锋过后
[01:15.34][02:27:00]仰望月夜眉间的寂寞
[01:19.99][02:31:01]你是滴水的沉着
[01:22.10][02:34:24]你是落花的幽弱
[01:25.83][02:37:05]你是万世称颂
[01:26.09][02:39:00]却为日落默默唉叹的血肉
[01:34:00]music...
"""
lrcDict = {}
musicLrcList = musicLrc.splitlines()
#print(musicLrcList)
for LrcLine in musicLrcList:
    # runCount = LrcLine.count(":")
    lrcLineList = lrcLine.split("]")
    for index in range(len(lrcLineList) - 1):
        timeStr = lrcLineList[index][1:]
        timeList = timeStr.split(":")
        time = float(timeList[0]) *60 + float(timeList[1])
        print(time)